#pragma once

// Name: DBD, Version: 4.6.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_SK_Hair_ACC01.AB_SK_Hair_ACC01_C
// 0x8569 (FullSize[0x87F9] - InheritedSize[0x0290])
class UAB_SK_Hair_ACC01_C : public UOniCustomizationItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0290(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x0298(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x02D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x02F8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7;                     // 0x0320(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6;                     // 0x0340(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5;                     // 0x0360(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4;                     // 0x0380(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7;                     // 0x03A0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8;                             // 0x03C0(0x0030)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6;                     // 0x03F0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7;                             // 0x0410(0x0030)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_21;                             // 0x0440(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_20;                             // 0x08A0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_19;                             // 0x0D00(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_18;                             // 0x1160(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_17;                             // 0x15C0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_16;                             // 0x1A20(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_15;                             // 0x1E80(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_14;                             // 0x22E0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_13;                             // 0x2740(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_12;                             // 0x2BA0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_11;                             // 0x3000(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_10;                             // 0x3460(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_9;                              // 0x38C0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_8;                              // 0x3D20(0x0460)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_2;                             // 0x4180(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5;                     // 0x41D0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x41F0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2;                             // 0x4268(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6;                             // 0x4338(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x4368(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_28;                               // 0x4408(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_27;                               // 0x4518(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_26;                               // 0x4628(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_25;                               // 0x4738(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_24;                               // 0x4848(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_23;                               // 0x4958(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_22;                               // 0x4A68(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_21;                               // 0x4B78(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_20;                               // 0x4C88(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_19;                               // 0x4D98(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_18;                               // 0x4EA8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_17;                               // 0x4FB8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_16;                               // 0x50C8(0x0110)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4;                     // 0x51D8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_15;                               // 0x51F8(0x0110)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5;                             // 0x5308(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x5338(0x0038)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3;                     // 0x5370(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2;                     // 0x5390(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace;                       // 0x53B0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3;                     // 0x53D0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4;                             // 0x53F0(0x0030)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2;                     // 0x5420(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3;                             // 0x5440(0x0030)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_7;                              // 0x5470(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_6;                              // 0x58D0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_5;                              // 0x5D30(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4;                              // 0x6190(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_3;                              // 0x65F0(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_2;                              // 0x6A50(0x0460)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics;                                // 0x6EB0(0x0460)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend;                               // 0x7310(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x7360(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive;                               // 0x73D8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x74A8(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_14;                               // 0x7548(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_13;                               // 0x7658(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_12;                               // 0x7768(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_11;                               // 0x7878(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_10;                               // 0x7988(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9;                                // 0x7A98(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8;                                // 0x7BA8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7;                                // 0x7CB8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6;                                // 0x7DC8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5;                                // 0x7ED8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4;                                // 0x7FE8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3;                                // 0x80F8(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2;                                // 0x8208(0x0110)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace;                       // 0x8318(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone;                                  // 0x8338(0x0110)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2;                             // 0x8448(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x8478(0x0038)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose;                               // 0x84B0(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x84E0(0x0038)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x8518(0x00B0)
	struct FAnimNode_CopyPoseFromMesh                  AnimGraphNode_CopyPoseFromMesh;                            // 0x85C8(0x0140) (ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                              // 0x8708(0x00B8)
	bool                                               Initialized;                                               // 0x87C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_8GSW[0x7];                                     // 0x87C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UskeletalMeshComponent*                      OwningCharacterSkeletalMesh;                               // 0x87C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               InMenu;                                                    // 0x87D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_01NM[0x3];                                     // 0x87D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              time;                                                      // 0x87D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                      RotationValue;                                             // 0x87D8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<float>                                      RotationValueDemon;                                        // 0x87E8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                               Toggle;                                                    // 0x87F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("AnimBlueprintGeneratedClass AB_SK_Hair_ACC01.AB_SK_Hair_ACC01_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_145F8D2646270CA2E9673AA6CE144CBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_B442A21F40953597D5A5F5873C82EA65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_93995A66441032F5FA4D34A17757BCA0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_A78ABC3446DD514DB8CD33ABB7A1C759();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_6255A97C425C46DACBB2F7BE10D83D3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_F0EA16C94DCC08E73EDB09B25F510F97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_8F12AD2944279D84AFA118845F9D2FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_2C56833048C215E99E5ACFB46F65463C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_2C5F1802470F463F0488A1B682A2214D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_E52A582C4ED758C7B1239BADC611B1B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_17F074AB4DAFC907CCBAC9877C1B473B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_E12953E14F2C57533DA8029BD8776A98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_6293561B4A9A09ED3B7C878A2D723492();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_84AE506E4F93536D86D86E935B372B39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_F4BC29CA467DC3E23B5A5F85B68748C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_19CCFD0243F38779391D42A7204E525B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_8760033F493DF5D27B1E30AB6FCF219F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_D9CD8A9C4A14FA2C0EBD70ABDB077CF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_97A171314F5D8EFA9FB958904C34CBB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_1751F5944D744BFC65A174AC1C7C851F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_775C6ABD448D7E961EEB789FB756ECAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_B8FEE45F4B243A468FB922981BCD3431();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_E1EE7A074CA5B89257235C846A209C4C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_042E3045428F2F74AE4B6080BB89D669();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_00AB0F90488B8EE3541B7997AA677D1C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_3FAC0D0D4770481397BD6D84EDA6354A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_D876DA1A4E872ED83CB810A213C411A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_ModifyBone_5CD1FBEC450B356EE9AF88AB17A4ACB4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_TransitionResult_C2CCB17542BE7D93993DBB9E728AA504();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_SK_Hair_ACC01_AnimGraphNode_TransitionResult_E7D9C1164B0FA5C6B9AAC5B6FD78E586();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_AB_SK_Hair_ACC01(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
