#pragma once

// Name: DBD, Version: 4.6.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class DBDBots.AIDisplayDebugInterface
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAIDisplayDebugInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AIDisplayDebugInterface");
		return ptr;
	}



};

// Class DBDBots.AIGoalGeneratorInterface
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAIGoalGeneratorInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AIGoalGeneratorInterface");
		return ptr;
	}



};

// Class DBDBots.AIIntentionValidatorInterface
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAIIntentionValidatorInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AIIntentionValidatorInterface");
		return ptr;
	}



};

// Class DBDBots.AIPathValidatorInterface
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAIPathValidatorInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AIPathValidatorInterface");
		return ptr;
	}



};

// Class DBDBots.AISkill
// 0x0090 (FullSize[0x00C0] - InheritedSize[0x0030])
class UAISkill : public UObject
{
public:
	struct FGameplayTagContainer                       RunContexts;                                               // 0x0030(0x0020) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               StopIfPausedByNavLinkProxy;                                // 0x0050(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9UEO[0x3];                                     // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RunTimeLimit;                                              // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RunCooldownTime;                                           // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RunCooldownTimeDeviation;                                  // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      SkillNavigationFilterClass;                                // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAISenseConfig*>                      SkillSenseConfigs;                                         // 0x0068(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                               DynamicSubtree;                                            // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_57T3[0x18];                                    // 0x0080(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UObject*>                             _pausedByObjects;                                          // 0x0098(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_XJNL[0x10];                                    // 0x00A8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDAIBTController*                          _aiControllerOwner;                                        // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill");
		return ptr;
	}



};

// Class DBDBots.AISkill_Diversion
// 0x0050 (FullSize[0x0110] - InheritedSize[0x00C0])
class UAISkill_Diversion : public UAISkill
{
public:
	struct FName                                       perkID;                                                    // 0x00C0(0x000C) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SMPD[0x4];                                     // 0x00CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UClass*>                              DiversionFromGoalClasses;                                  // 0x00D0(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EAIDifficultyLevel                  ThrowOnInteractablesAtDifficultyLevel;                     // 0x00E0(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZMTO[0x3];                                     // 0x00E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MaxThrowOnInteractableHalfAngle;                           // 0x00E4(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxMoveToTargetDistance;                                   // 0x00E8(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Fvector                                     NavMeshFindLocationExtents;                                // 0x00EC(0x000C) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PlanInterval;                                              // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TG7U[0x14];                                    // 0x00FC(0x0014) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Diversion");
		return ptr;
	}



};

// Class DBDBots.AISkill_Find
// 0x0040 (FullSize[0x0100] - InheritedSize[0x00C0])
class UAISkill_Find : public UAISkill
{
public:
	class UClass*                                      FindClass;                                                 // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FgameplayTag                                BlackboardWishListTag;                                     // 0x00C8(0x000C) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SearchInterval;                                            // 0x00D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               MustBeSeen;                                                // 0x00D8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W7ZG[0x7];                                     // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UObject*>                             _currentWishedObjects;                                     // 0x00E0(0x0010) (ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_CJCR[0x10];                                    // 0x00F0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Find");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable
// 0x0018 (FullSize[0x0118] - InheritedSize[0x0100])
class UAISkill_FindInteractable : public UAISkill_Find
{
public:
	struct FString                                     RequiredInteractionId;                                     // 0x0100(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInputInteractionType               RequiredInteractionInputType;                              // 0x0110(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_X2RE[0x7];                                     // 0x0111(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindCollectable
// 0x0008 (FullSize[0x0120] - InheritedSize[0x0118])
class UAISkill_FindCollectable : public UAISkill_FindInteractable
{
public:
	int                                                CollectUnderItemCount;                                     // 0x0118(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CollectOverItemChargeRatio;                                // 0x011C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindCollectable");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindCollectable_Camper
// 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
class UAISkill_FindCollectable_Camper : public UAISkill_FindCollectable
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindCollectable_Camper");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindCollectable_Hatchet
// 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
class UAISkill_FindCollectable_Hatchet : public UAISkill_FindCollectable
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindCollectable_Hatchet");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindCollectable_Searchable
// 0x0018 (FullSize[0x0138] - InheritedSize[0x0120])
class UAISkill_FindCollectable_Searchable : public UAISkill_FindCollectable
{
public:
	float                                              SearchIntervalAfterOpenSearchable;                         // 0x0120(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OpenSearchableRelevancyDuration;                           // 0x0124(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_4BGY[0x8];                                     // 0x0128(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USearchable*                                 _relevantSearchable;                                       // 0x0130(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindCollectable_Searchable");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindCollectable_Trap
// 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
class UAISkill_FindCollectable_Trap : public UAISkill_FindCollectable
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindCollectable_Trap");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable_SolveRBT
// 0x0010 (FullSize[0x0128] - InheritedSize[0x0118])
class UAISkill_FindInteractable_SolveRBT : public UAISkill_FindInteractable
{
public:
	struct FAITunableParameter                         UrgencyGoalWeight;                                         // 0x0118(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable_SolveRBT");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable_SolveSickness
// 0x0010 (FullSize[0x0128] - InheritedSize[0x0118])
class UAISkill_FindInteractable_SolveSickness : public UAISkill_FindInteractable
{
public:
	struct FAITunableParameter                         UrgencyGoalWeight;                                         // 0x0118(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable_SolveSickness");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable_StatusEffect
// 0x0010 (FullSize[0x0128] - InheritedSize[0x0118])
class UAISkill_FindInteractable_StatusEffect : public UAISkill_FindInteractable
{
public:
	struct FgameplayTag                                RequiredPerkFlag;                                          // 0x0118(0x000C) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               InvertCondition;                                           // 0x0124(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XTGA[0x3];                                     // 0x0125(0x0003) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable_StatusEffect");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable_StatusEffect_Plague
// 0x0000 (FullSize[0x0128] - InheritedSize[0x0128])
class UAISkill_FindInteractable_StatusEffect_Plague : public UAISkill_FindInteractable_StatusEffect
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable_StatusEffect_Plague");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindInteractable_Waker
// 0x0000 (FullSize[0x0118] - InheritedSize[0x0118])
class UAISkill_FindInteractable_Waker : public UAISkill_FindInteractable
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindInteractable_Waker");
		return ptr;
	}



};

// Class DBDBots.AISkill_FindOrb
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAISkill_FindOrb : public UAISkill_Find
{
public:
	unsigned char                                      UnknownData_E6AM[0x8];                                     // 0x0100(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_FindOrb");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction
// 0x00B0 (FullSize[0x0170] - InheritedSize[0x00C0])
class UAISkill_Interaction : public UAISkill
{
public:
	DeadByDaylight_EPawnInputPressTypes                InputType;                                                 // 0x00C0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDBots_EInteractionSkillInputModes                InputMode;                                                 // 0x00C1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EPawnInputPressTypes                CancelInputType;                                           // 0x00C2(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDBots_EInteractionCancelInputModes               CancelInputMode;                                           // 0x00C3(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoLockInput;                                             // 0x00C4(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5MLT[0x3];                                     // 0x00C5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAIRoll                                     StartRoll;                                                 // 0x00C8(0x0024) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YD30[0x4];                                     // 0x00EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     StartInteractionID;                                        // 0x00F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     StopInteractionID;                                         // 0x0100(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinHoldInputTime;                                          // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoReleaseHoldInputWhenCharged;                           // 0x0114(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5RNA[0x5B];                                    // 0x0115(0x005B) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_AttachRBT
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_AttachRBT : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_AttachRBT");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_ForThePeople
// 0x0018 (FullSize[0x0188] - InheritedSize[0x0170])
class UAISkill_Interaction_ForThePeople : public UAISkill_Interaction
{
public:
	unsigned char                                      UnknownData_HXL5[0x8];                                     // 0x0170(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     BlockInteractionId;                                        // 0x0178(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_ForThePeople");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_Kill
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_Kill : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_Kill");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_OrbAbsorb
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_OrbAbsorb : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_OrbAbsorb");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_Reel
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_Reel : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_Reel");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_ReloadClown
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_ReloadClown : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_ReloadClown");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_SendToDeathBed
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_SendToDeathBed : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_SendToDeathBed");
		return ptr;
	}



};

// Class DBDBots.AISkill_Interaction_StaticBlast
// 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
class UAISkill_Interaction_StaticBlast : public UAISkill_Interaction
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_Interaction_StaticBlast");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionSetTrap
// 0x0010 (FullSize[0x0180] - InheritedSize[0x0170])
class UAISkill_InteractionSetTrap : public UAISkill_Interaction
{
public:
	class UClass*                                      TrapClass;                                                 // 0x0170(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxDistanceFromPointOfInterest;                            // 0x0178(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxDistanceFromAnotherSetTrap;                             // 0x017C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionSetTrap");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionSetTrap_Demogorgon
// 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
class UAISkill_InteractionSetTrap_Demogorgon : public UAISkill_InteractionSetTrap
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionSetTrap_Demogorgon");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionSetTrap_DreamPallet
// 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
class UAISkill_InteractionSetTrap_DreamPallet : public UAISkill_InteractionSetTrap
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionSetTrap_DreamPallet");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionSetTrap_DreamSnare
// 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
class UAISkill_InteractionSetTrap_DreamSnare : public UAISkill_InteractionSetTrap
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionSetTrap_DreamSnare");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionSetTrap_Phantom
// 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
class UAISkill_InteractionSetTrap_Phantom : public UAISkill_InteractionSetTrap
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionSetTrap_Phantom");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget
// 0x00B0 (FullSize[0x0220] - InheritedSize[0x0170])
class UAISkill_InteractionTarget : public UAISkill_Interaction
{
public:
	DBDBots_EInteractionTargetRequirements             TargetRequirement;                                         // 0x0170(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoSwapBestStimulusWithBestTarget;                        // 0x0171(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A5P2[0x2];                                     // 0x0172(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              StartMinRange;                                             // 0x0174(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartMaxRange;                                             // 0x0178(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StopMinRange;                                              // 0x017C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StopMaxRange;                                              // 0x0180(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartMaxHalfAngle;                                         // 0x0184(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StopMaxHalfAngle;                                          // 0x0188(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsMaxHalfAngle2D;                                          // 0x018C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               TestMaxHalfAngleOnPath;                                    // 0x018D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ECBK[0x2];                                     // 0x018E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      MaxAngleFilterClass;                                       // 0x0190(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDBots_EInteractionTargetInSightModes             InSightMode;                                               // 0x0198(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CYT5[0x3];                                     // 0x0199(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              OutOfSightModeDelay;                                       // 0x019C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TargetMoveAwayTooFastStopDelay;                            // 0x01A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TargetMoveAwayTooFastCooldown;                             // 0x01A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AlwaysStrafeAroundTarget;                                  // 0x01A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7KQS[0x7];                                     // 0x01A9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FAIDetectedStimulus>                 _unfilteredTargets;                                        // 0x01B0(0x0010) (ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAIDetectedStimulus>                 _filteredTargets;                                          // 0x01C0(0x0010) (ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class Uactor*, struct FTargetMoveAwayToFastInfo> _targetsMoveAwayTooFastInfo;                               // 0x01D0(0x0050) (Transient, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Aim
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Aim : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Aim");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_AmbushAttack
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_AmbushAttack : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_AmbushAttack");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_AmbushMode
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_AmbushMode : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_AmbushMode");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Cloak
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Cloak : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Cloak");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Dash
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Dash : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Dash");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashAttack
// 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_DashAttack : public UAISkill_InteractionTarget_Dash
{
public:
	float                                              DashAttackUnderMaxRange;                                   // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DashAttackUnderMaxHalfAngle;                               // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EAttackType                         ExpectedAttackType;                                        // 0x0228(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VI9U[0x7];                                     // 0x0229(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashAttack");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashAttack_Cannibal
// 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
class UAISkill_InteractionTarget_DashAttack_Cannibal : public UAISkill_InteractionTarget_DashAttack
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashAttack_Cannibal");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashAttack_Chainsaw
// 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
class UAISkill_InteractionTarget_DashAttack_Chainsaw : public UAISkill_InteractionTarget_DashAttack
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashAttack_Chainsaw");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashAttack_Demogorgon
// 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
class UAISkill_InteractionTarget_DashAttack_Demogorgon : public UAISkill_InteractionTarget_DashAttack
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashAttack_Demogorgon");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashHillbilly
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_DashHillbilly : public UAISkill_InteractionTarget_Dash
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashHillbilly");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DashOni
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_DashOni : public UAISkill_InteractionTarget_Dash
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DashOni");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DeadHard
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_DeadHard : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DeadHard");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_DemonMode
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_DemonMode : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_DemonMode");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Fire
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Fire : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Fire");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Frenzy
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Frenzy : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Frenzy");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_LungeAttack
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_LungeAttack : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_LungeAttack");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_PhaseWalk
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_PhaseWalk : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_PhaseWalk");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_ReloadDeathSlinger
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_ReloadDeathSlinger : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_ReloadDeathSlinger");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_ShockTherapy
// 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_ShockTherapy : public UAISkill_InteractionTarget
{
public:
	float                                              TargetToEvadePointMaxDistance;                             // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CastShockTimeBuffer;                                       // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_ShockTherapy");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Stalk
// 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Stalk : public UAISkill_InteractionTarget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Stalk");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_StalkGhost
// 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_StalkGhost : public UAISkill_InteractionTarget_Stalk
{
public:
	float                                              CautiousModeUnderTargetRange;                              // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CautiousModeSpeedFactor;                                   // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BackFromCautiousDelay;                                     // 0x0228(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IL0C[0x4];                                     // 0x022C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_StalkGhost");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_StalkShape
// 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_StalkShape : public UAISkill_InteractionTarget_Stalk
{
public:
	int                                                StalkRangeLimitedAtEvilTier;                               // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxStalkRangeWhenLimitedByEvilTier;                        // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_StalkShape");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_StealthGhost
// 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_StealthGhost : public UAISkill_InteractionTarget
{
public:
	float                                              CrouchSwapDelay;                                           // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JTL4[0x4];                                     // 0x0224(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_StealthGhost");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_Throw
// 0x0078 (FullSize[0x0298] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_Throw : public UAISkill_InteractionTarget
{
public:
	DBDBots_EAIThrowPredictionModes                    ThrowPredictionMode;                                       // 0x0220(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PM9Z[0x3];                                     // 0x0221(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MaxAddPitchAngle;                                          // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDBots_EAIThrowProjectileModes                    ThrowProjectileMode;                                       // 0x0228(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Z4LS[0x3];                                     // 0x0229(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAITunableParameter                         HoldInputTimeRandDeviation;                                // 0x022C(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                         PitchAngleRandDeviation;                                   // 0x023C(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1SEU[0x4C];                                    // 0x024C(0x004C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_Throw");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_ThrowClown
// 0x0000 (FullSize[0x0298] - InheritedSize[0x0298])
class UAISkill_InteractionTarget_ThrowClown : public UAISkill_InteractionTarget_Throw
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_ThrowClown");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_ThrowHatchet
// 0x0000 (FullSize[0x0298] - InheritedSize[0x0298])
class UAISkill_InteractionTarget_ThrowHatchet : public UAISkill_InteractionTarget_Throw
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_ThrowHatchet");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_ThrowPlague
// 0x0010 (FullSize[0x02A8] - InheritedSize[0x0298])
class UAISkill_InteractionTarget_ThrowPlague : public UAISkill_InteractionTarget_Throw
{
public:
	struct FgameplayTag                                ProjectileDamageSickTargetTag;                             // 0x0298(0x000C) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RZUI[0x4];                                     // 0x02A4(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_ThrowPlague");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_TormentAttack
// 0x0030 (FullSize[0x0250] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_TormentAttack : public UAISkill_InteractionTarget
{
public:
	int                                                AdvancedAtNbDetectedTargets;                               // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIRoll                                     AdvancedStartRoll;                                         // 0x0224(0x0024) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8XAQ[0x8];                                     // 0x0248(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_TormentAttack");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTarget_TormentMode
// 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
class UAISkill_InteractionTarget_TormentMode : public UAISkill_InteractionTarget
{
public:
	float                                              ChasedTargetToEvadePointMaxDistance;                       // 0x0220(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartTormentInPatrolAboveChargeRatio;                      // 0x0224(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartTormentInChaseAboveChargeRatio;                       // 0x0228(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_NG5K[0x4];                                     // 0x022C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTarget_TormentMode");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTeleport
// 0x0008 (FullSize[0x0178] - InheritedSize[0x0170])
class UAISkill_InteractionTeleport : public UAISkill_Interaction
{
public:
	float                                              BlockTeleportWhenPathGoalUnderRange;                       // 0x0170(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6ZNB[0x4];                                     // 0x0174(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTeleport");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTeleportEthereal
// 0x0050 (FullSize[0x01C8] - InheritedSize[0x0178])
class UAISkill_InteractionTeleportEthereal : public UAISkill_InteractionTeleport
{
public:
	float                                              TeleportPlanInterval;                                      // 0x0178(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxTeleportAlignHalfAngle;                                 // 0x017C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AbortNotWorkingTeleportDelay;                              // 0x0180(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AbortAddRunCooldownPenaltyTime;                            // 0x0184(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QXYZ[0x18];                                    // 0x0188(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class Uactor*                                      _onStimulusInstigator;                                     // 0x01A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_PMWX[0x20];                                    // 0x01A8(0x0020) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTeleportEthereal");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTeleportEthereal_Blink
// 0x0010 (FullSize[0x01D8] - InheritedSize[0x01C8])
class UAISkill_InteractionTeleportEthereal_Blink : public UAISkill_InteractionTeleportEthereal
{
public:
	float                                              StartBlinkAtWarpLocationRange;                             // 0x01C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ValidateBlinkWarpRange;                                    // 0x01CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BlinkAboveSavedPathLength;                                 // 0x01D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BlinkIfTargetWillBeInRange;                                // 0x01D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTeleportEthereal_Blink");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTeleportEthereal_Demogorgon
// 0x0018 (FullSize[0x01E0] - InheritedSize[0x01C8])
class UAISkill_InteractionTeleportEthereal_Demogorgon : public UAISkill_InteractionTeleportEthereal
{
public:
	float                                              MaxRangeFromFirstPortal;                                   // 0x01C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_71R7[0x4];                                     // 0x01CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDemogorgonPortal*                           _firstPortal;                                              // 0x01D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDemogorgonPortal*                           _secondPortal;                                             // 0x01D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTeleportEthereal_Demogorgon");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionTeleportEthereal_Nightmare
// 0x0010 (FullSize[0x01D8] - InheritedSize[0x01C8])
class UAISkill_InteractionTeleportEthereal_Nightmare : public UAISkill_InteractionTeleportEthereal
{
public:
	float                                              TeleportIfPathLengthSavedAboveRange;                       // 0x01C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UBV5[0x4];                                     // 0x01CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class Ugenerator*                                  _toGenerator;                                              // 0x01D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionTeleportEthereal_Nightmare");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionUseItem
// 0x0008 (FullSize[0x0178] - InheritedSize[0x0170])
class UAISkill_InteractionUseItem : public UAISkill_Interaction
{
public:
	DBDSharedTypes_ELoadoutItemType                    itemType;                                                  // 0x0170(0x0001) ELEMENT_SIZE_MISMATCH (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FFRA[0x3];                                     // 0x0170(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData_AAER[0x4];                                     // 0x0174(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionUseItem");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionUseItem_Firecracker
// 0x0018 (FullSize[0x0190] - InheritedSize[0x0178])
class UAISkill_InteractionUseItem_Firecracker : public UAISkill_InteractionUseItem
{
public:
	struct FAITunableParameter                         StartMaxRange;                                             // 0x0178(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              TargetFaceMeMaxAngle;                                      // 0x0188(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1Q1W[0x4];                                     // 0x018C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionUseItem_Firecracker");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionUseItem_Flashlight
// 0x0068 (FullSize[0x01E0] - InheritedSize[0x0178])
class UAISkill_InteractionUseItem_Flashlight : public UAISkill_InteractionUseItem
{
public:
	struct FAIRoll                                     VulnerableTargetStartRoll;                                 // 0x0178(0x0024) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              TargetFaceMeMaxAngle;                                      // 0x019C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class Uactor*                                      _targetActor;                                              // 0x01A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_BM4Y[0x38];                                    // 0x01A8(0x0038) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionUseItem_Flashlight");
		return ptr;
	}



};

// Class DBDBots.AISkill_InteractionUseItem_Map
// 0x0000 (FullSize[0x0178] - InheritedSize[0x0178])
class UAISkill_InteractionUseItem_Map : public UAISkill_InteractionUseItem
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class DBDBots.AISkill_InteractionUseItem_Map");
		return ptr;
	}



