#pragma once

// Name: DBD, Version: 4.6.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Engine.actor
// 0x0200 (FullSize[0x0230] - InheritedSize[0x0030])
class Uactor : public UObject
{
public:
	struct FActorTickFunction                          PrimaryActorTick;                                          // 0x0030(0x0030) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      bNetTemporary : 1;                                         // 0x0060(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bNetStartup : 1;                                           // 0x0060(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                  // 0x0060(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAlwaysRelevant : 1;                                       // 0x0060(0x0001) BIT_FIELD (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bReplicateMovement : 1;                                    // 0x0060(0x0001) BIT_FIELD (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bHidden : 1;                                               // 0x0060(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bTearOff : 1;                                              // 0x0060(0x0001) BIT_FIELD (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bExchangedRoles : 1;                                       // 0x0060(0x0001) BIT_FIELD (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bNetLoadOnClient : 1;                                      // 0x0061(0x0001) BIT_FIELD (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                 // 0x0061(0x0001) BIT_FIELD (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bRelevantForNetworkReplays : 1;                            // 0x0061(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bRelevantForLevelBounds : 1;                               // 0x0061(0x0001) BIT_FIELD (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bReplayRewindable : 1;                                     // 0x0061(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                             // 0x0061(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                              // 0x0061(0x0001) BIT_FIELD (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bCanBeDamaged : 1;                                         // 0x0061(0x0001) BIT_FIELD (Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bBlockInput : 1;                                           // 0x0062(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bCollideWhenPlacing : 1;                                   // 0x0062(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                    // 0x0062(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;            // 0x0062(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bIgnoresOriginShifting : 1;                                // 0x0062(0x0001) BIT_FIELD (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bEnableAutoLODGeneration : 1;                              // 0x0062(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bIsEditorOnlyActor : 1;                                    // 0x0062(0x0001) BIT_FIELD (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bActorSeamlessTraveled : 1;                                // 0x0062(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bReplicates : 1;                                           // 0x0063(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bCanBeInCluster : 1;                                       // 0x0063(0x0001) BIT_FIELD (Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;               // 0x0063(0x0001) BIT_FIELD (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_82BY : 5;                                      // 0x0063(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      UnknownData_QQJ7 : 2;                                      // 0x0064(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bActorEnableCollision : 1;                                 // 0x0064(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bActorIsBeingDestroyed : 1;                                // 0x0064(0x0001) BIT_FIELD (Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	Engine_EActorUpdateOverlapsMethod                  UpdateOverlapsMethodDuringLevelStreaming;                  // 0x0065(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Engine_EActorUpdateOverlapsMethod                  DefaultUpdateOverlapsMethodDuringLevelStreaming;           // 0x0066(0x0001) (Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TEnumAsByte<Engine_ENetRole>                       RemoteRole;                                                // 0x0067(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRepMovement                                ReplicatedMovement;                                        // 0x0068(0x0034) (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	float                                              InitialLifeSpan;                                           // 0x009C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CustomTimeDilation;                                        // 0x00A0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ONVT[0x4];                                     // 0x00A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FRepAttachment                              AttachmentReplication;                                     // 0x00A8(0x0040) (Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class Uactor*                                      owner;                                                     // 0x00E8(0x0008) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       NetDriverName;                                             // 0x00F0(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TEnumAsByte<Engine_ENetRole>                       role;                                                      // 0x00FC(0x0001) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TEnumAsByte<Engine_ENetDormancy>                   NetDormancy;                                               // 0x00FD(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Engine_ESpawnActorCollisionHandlingMethod          SpawnCollisionHandlingMethod;                              // 0x00FE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<Engine_EAutoReceiveInput>              AutoReceiveInput;                                          // 0x00FF(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                InputPriority;                                             // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UVLQ[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UInputComponent*                             InputComponent;                                            // 0x0108(0x0008) (ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NetCullDistanceSquared;                                    // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NetTag;                                                    // 0x0114(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NetUpdateFrequency;                                        // 0x0118(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinNetUpdateFrequency;                                     // 0x011C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NetPriority;                                               // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SQR2[0x4];                                     // 0x0124(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class Upawn*                                       instigator;                                                // 0x0128(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class Uactor*>                              Children;                                                  // 0x0130(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                             rootComponent;                                             // 0x0140(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMatineeActor*>                       ControllingMatineeActors;                                  // 0x0148(0x0010) (ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_HYN3[0x8];                                     // 0x0158(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               Layers;                                                    // 0x0160(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UChildActorComponent>         ParentComponent;                                           // 0x0170(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_W0AI[0x8];                                     // 0x0178(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               tags;                                                      // 0x0180(0x0010) (Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnTakeAnyDamage;                                           // 0x0190(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnTakePointDamage;                                         // 0x0191(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnTakeRadialDamage;                                        // 0x0192(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnActorBeginOverlap;                                       // 0x0193(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnActorEndOverlap;                                         // 0x0194(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnBeginCursorOver;                                         // 0x0195(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnEndCursorOver;                                           // 0x0196(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnClicked;                                                 // 0x0197(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnReleased;                                                // 0x0198(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnInputTouchBegin;                                         // 0x0199(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnInputTouchEnd;                                           // 0x019A(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnInputTouchEnter;                                         // 0x019B(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnInputTouchLeave;                                         // 0x019C(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnActorHit;                                                // 0x019D(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnDestroyed;                                               // 0x019E(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnEndPlay;                                                 // 0x019F(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AW7S[0x60];                                    // 0x01A0(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UactorComponent*>                     InstanceComponents;                                        // 0x0200(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UactorComponent*>                     BlueprintCreatedComponents;                                // 0x0210(0x0010) (ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KIQ2[0x10];                                    // 0x0220(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.actor");
		return ptr;
	}



	bool WasRecentlyRendered(float tolerance);
	void UserConstructionScript();
	void TearOff();
	void SnapRootComponentTo(class Uactor* InParentActor, const struct FName& InSocketName);
	void SetTickGroup(TEnumAsByte<Engine_ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetOwner(class Uactor* NewOwner);
	void SetNetDormancy(TEnumAsByte<Engine_ENetDormancy> NewDormancy);
	void SetLifeSpan(float InLifespan);
	void SetAutoDestroyWhenFinished(bool bVal);
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct Fvector& NewScale3D);
	void SetActorRelativeScale3D(const struct Fvector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UactorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class Uactor* PrerequisiteActor);
	void ReceiveTick(float deltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct Fvector& origin, const struct FhitResult& HitInfo, class Ucontroller* InstigatedBy, class Uactor* DamageCauser);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct Fvector& HitLocation, const struct Fvector& HitNormal, class UprimitiveComponent* hitComponent, const struct FName& BoneName, const struct Fvector& ShotFromDirection, class Ucontroller* InstigatedBy, class Uactor* DamageCauser, const struct FhitResult& HitInfo);
	void ReceiveHit(class UprimitiveComponent* MyComp, class Uactor* other, class UprimitiveComponent* otherComp, bool bSelfMoved, const struct Fvector& HitLocation, const struct Fvector& HitNormal, const struct Fvector& normalImpulse, const struct FhitResult& hit);
	void ReceiveEndPlay(TEnumAsByte<Engine_EEndPlayReason> endPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class Ucontroller* InstigatedBy, class Uactor* DamageCauser);
	void ReceiveActorOnReleased(const struct Fkey& ButtonReleased);
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnClicked(const struct Fkey& ButtonPressed);
	void ReceiveActorEndOverlap(class Uactor* otherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class Uactor* otherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float seconds, bool bEnableStreaming, int CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void MakeNoise(float Loudness, class Upawn* NoiseInstigator, const struct Fvector& NoiseLocation, float MaxRange, const struct FName& tag);
	class UMaterialInstanceDynamic* MakeMIDForMaterial(class UmaterialInterface* Parent);
	bool K2_TeleportTo(const struct Fvector& DestLocation, const struct FRotator& DestRotation);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(const struct Fvector& NewRelativeLocation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocationAndRotation(const struct Fvector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocation(const struct Fvector& NewLocation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_OnReset();
	void K2_OnEndViewTarget(class UplayerController* PC);
	void K2_OnBecomeViewTarget(class UplayerController* PC);
	class USceneComponent* K2_GetRootComponent();
	TArray<class UactorComponent*> K2_GetComponentsByClass(class UClass* ComponentClass);
	struct FRotator K2_GetActorRotation();
	struct Fvector K2_GetActorLocation();
	void K2_DetachFromActor(Engine_EDetachmentRule LocationRule, Engine_EDetachmentRule RotationRule, Engine_EDetachmentRule ScaleRule);
	void K2_DestroyComponent(class UactorComponent* component);
	void K2_DestroyActor();
	void K2_AttachToComponent(class USceneComponent* Parent, const struct FName& SocketName, Engine_EAttachmentRule LocationRule, Engine_EAttachmentRule RotationRule, Engine_EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachToActor(class Uactor* ParentActor, const struct FName& SocketName, Engine_EAttachmentRule LocationRule, Engine_EAttachmentRule RotationRule, Engine_EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class Uactor* InParentActor, const struct FName& InSocketName, TEnumAsByte<Engine_EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<Engine_EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(const struct Fvector& DeltaLocation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalOffset(const struct Fvector& DeltaLocation, bool bSweep, struct FhitResult* SweepHitResult, bool bTeleport);
	bool IsOverlappingActor(class Uactor* other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	float GetVerticalDistanceTo(class Uactor* otherActor);
	struct Fvector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredDistanceTo(class Uactor* otherActor);
	TEnumAsByte<Engine_ENetRole> GetRemoteRole();
	class UChildActorComponent* GetParentComponent();
	class Uactor* GetParentActor();
	class Uactor* GetOwner();
	void GetOverlappingComponents(TArray<class UprimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(TArray<class Uactor*>* OverlappingActors, class UClass* ClassFilter);
	TEnumAsByte<Engine_ENetRole> GetLocalRole();
	float GetLifeSpan();
	class Ucontroller* GetInstigatorController();
	class Upawn* GetInstigator();
	struct Fvector GetInputVectorAxisValue(const struct Fkey& InputAxisKey);
	float GetInputAxisValue(const struct FName& InputAxisName);
	float GetInputAxisKeyValue(const struct Fkey& InputAxisKey);
	float GetHorizontalDotProductTo(class Uactor* otherActor);
	float GetHorizontalDistanceTo(class Uactor* otherActor);
	float GetGameTimeSinceCreation();
	float GetDotProductTo(class Uactor* otherActor);
	float GetDistanceTo(class Uactor* otherActor);
	TArray<class UactorComponent*> GetComponentsByTag(class UClass* ComponentClass, const struct FName& tag);
	TArray<class UactorComponent*> GetComponentsByInterface(class UClass* Interface);
	class UactorComponent* GetComponentByClass(class UClass* ComponentClass);
	struct FName GetAttachParentSocketName();
	class Uactor* GetAttachParentActor();
	void GetAttachedActors(TArray<class Uactor*>* OutActors, bool bResetArray);
	void GetAllChildActors(TArray<class Uactor*>* ChildActors, bool bIncludeDescendants);
	struct Fvector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct Fvector GetActorScale3D();
	struct Fvector GetActorRightVector();
	struct Fvector GetActorRelativeScale3D();
	struct Fvector GetActorForwardVector();
	void GetActorEyesViewPoint(struct Fvector* OutLocation, struct FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, struct Fvector* origin, struct Fvector* BoxExtent, bool bIncludeFromChildActors);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void EnableInput(class UplayerController* playerController);
	void DisableInput(class UplayerController* playerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void AddTickPrerequisiteComponent(class UactorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class Uactor* PrerequisiteActor);
	class UactorComponent* AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext);
	bool ActorHasTag(const struct FName& tag);
};

// Class Engine.gameInstance
// 0x01C0 (FullSize[0x01F0] - InheritedSize[0x0030])
class UgameInstance : public UObject
{
public:
	unsigned char                                      UnknownData_91JI[0x10];                                    // 0x0030(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class ULocalPlayer*>                        LocalPlayers;                                              // 0x0040(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOnlineSession*                              OnlineSession;                                             // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                             ReferencedObjects;                                         // 0x0058(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_F2D3[0x188];                                   // 0x0068(0x0188) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.gameInstance");
		return ptr;
	}



	void ToggleDisableComponent(const struct FString& comp);
	void ReceiveShutdown();
	void ReceiveInit();
	void HandleTravelError(TEnumAsByte<Engine_ETravelFailure> FailureType);
	void HandleNetworkError(TEnumAsByte<Engine_ENetworkFailure> FailureType, bool bIsServer);
	void DumpDisabledComponents();
	void DebugRemovePlayer(int ControllerID);
	void DebugCreatePlayer(int ControllerID);
};

// Class Engine.Info
// 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
class UInfo : public Uactor
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.Info");
		return ptr;
	}



};

// Class Engine.BlueprintFunctionLibrary
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UBlueprintFunctionLibrary : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.BlueprintFunctionLibrary");
		return ptr;
	}



};

// Class Engine.BlueprintAsyncActionBase
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UBlueprintAsyncActionBase : public UObject
{
public:
	unsigned char                                      UnknownData_MCH8[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.BlueprintAsyncActionBase");
		return ptr;
	}



	void activate();
};

// Class Engine.OnlineBlueprintCallProxyBase
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.OnlineBlueprintCallProxyBase");
		return ptr;
	}



};

// Class Engine.player
// 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
class Uplayer : public UObject
{
public:
	unsigned char                                      UnknownData_5VLG[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UplayerController*                           playerController;                                          // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CurrentNetSpeed;                                           // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ConfiguredInternetSpeed;                                   // 0x0044(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ConfiguredLanSpeed;                                        // 0x0048(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XM6K[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.player");
		return ptr;
	}



};

// Class Engine.NetConnection
// 0x19F8 (FullSize[0x1A48] - InheritedSize[0x0050])
class UNetConnection : public Uplayer
{
public:
	TArray<class UChildConnection*>                    Children;                                                  // 0x0050(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetDriver*                                  Driver;                                                    // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      PackageMapClass;                                           // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackageMap*                                 PackageMap;                                                // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class Uchannel*>                            OpenChannels;                                              // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class Uactor*>                              SentTemporaries;                                           // 0x0088(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class Uactor*                                      ViewTarget;                                                // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class Uactor*                                      OwningActor;                                               // 0x00A0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxPacket;                                                 // 0x00A8(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      InternalAck : 1;                                           // 0x00AC(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JAN1[0xBB];                                    // 0x00AD(0x00BB) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FUniqueNetIdRepl                            playerId;                                                  // 0x0168(0x0028) (HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AYMS[0x48];                                    // 0x0190(0x0048) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	double                                             LastReceiveTime;                                           // 0x01D8(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K543[0x1338];                                  // 0x01E0(0x1338) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class Uchannel*>                            ChannelsToTick;                                            // 0x1518(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_5210[0x520];                                   // 0x1528(0x0520) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.NetConnection");
		return ptr;
	}



};

// Class Engine.NetDriver
// 0x0730 (FullSize[0x0760] - InheritedSize[0x0030])
class UNetDriver : public UObject
{
public:
	unsigned char                                      UnknownData_G36U[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     NetConnectionClassName;                                    // 0x0038(0x0010) (ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ReplicationDriverClassName;                                // 0x0048(0x0010) (ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxDownloadSize;                                           // 0x0058(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bClampListenServerTickRate : 1;                            // 0x005C(0x0001) BIT_FIELD (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YM0F[0x3];                                     // 0x005D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                NetServerMaxTickRate;                                      // 0x0060(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxNetTickRate;                                            // 0x0064(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxInternetClientRate;                                     // 0x0068(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxClientRate;                                             // 0x006C(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ServerTravelPause;                                         // 0x0070(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SpawnPrioritySeconds;                                      // 0x0074(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RelevantTimeout;                                           // 0x0078(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              KeepAliveTime;                                             // 0x007C(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InitialConnectTimeout;                                     // 0x0080(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ConnectionTimeout;                                         // 0x0084(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimeoutMultiplierForUnoptimizedBuilds;                     // 0x0088(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNoTimeouts;                                               // 0x008C(0x0001) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNeverApplyNetworkEmulationSettings;                       // 0x008D(0x0001) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WUI0[0x2];                                     // 0x008E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UNetConnection*                              ServerConnection;                                          // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNetConnection*>                      ClientConnections;                                         // 0x0098(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ST3D[0x60];                                    // 0x00A8(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                RecentlyDisconnectedTrackingTime;                          // 0x0108(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HZX9[0x3C];                                    // 0x010C(0x003C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class Uworld*                                      world;                                                     // 0x0148(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackage*                                    WorldPackage;                                              // 0x0150(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HJCL[0x20];                                    // 0x0158(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      NetConnectionClass;                                        // 0x0178(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      ReplicationDriverClass;                                    // 0x0180(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7TPW[0x10];                                    // 0x0188(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       NetDriverName;                                             // 0x0198(0x000C) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IXHH[0x4];                                     // 0x01A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FChannelDefinition>                  ChannelDefinitions;                                        // 0x01A8(0x0010) (ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FName, struct FChannelDefinition>      ChannelDefinitionMap;                                      // 0x01B8(0x0050) (NativeAccessSpecifierPublic)
	TArray<class Uchannel*>                            ActorChannelPool;                                          // 0x0208(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_LW5V[0x8];                                     // 0x0218(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              time;                                                      // 0x0220(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1RSW[0x4AC];                                   // 0x0224(0x04AC) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ExpireViewTargetDelay;                                     // 0x06D0(0x0004) (ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_LMAM[0x2C];                                    // 0x06D4(0x002C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UReplicationDriver*                          ReplicationDriver;                                         // 0x0700(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_MBBI[0x58];                                    // 0x0708(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.NetDriver");
		return ptr;
	}



};

// Class Engine.OnlineEngineInterface
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UOnlineEngineInterface : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.OnlineEngineInterface");
		return ptr;
	}



};

// Class Engine.DeveloperSettings
// 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
class UDeveloperSettings : public UObject
{
public:
	unsigned char                                      UnknownData_8TZ8[0x18];                                    // 0x0030(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.DeveloperSettings");
		return ptr;
	}



};

// Class Engine.OnlineSession
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UOnlineSession : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.OnlineSession");
		return ptr;
	}



};

// Class Engine.actorComponent
// 0x0088 (FullSize[0x00B8] - InheritedSize[0x0030])
class UactorComponent : public UObject
{
public:
	unsigned char                                      UnknownData_8JTV[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FActorComponentTickFunction                 PrimaryComponentTick;                                      // 0x0038(0x0030) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FName>                               ComponentTags;                                             // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                      AssetUserData;                                             // 0x0078(0x0010) (Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_YTD5[0x4];                                     // 0x0088(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                UCSSerializationIndex;                                     // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_YNWV : 3;                                      // 0x0090(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bNetAddressable : 1;                                       // 0x0090(0x0001) BIT_FIELD (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bReplicates : 1;                                           // 0x0090(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_P20D : 3;                                      // 0x0090(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      UnknownData_SFV0 : 7;                                      // 0x0091(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bAutoActivate : 1;                                         // 0x0091(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bIsActive : 1;                                             // 0x0092(0x0001) BIT_FIELD (Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bEditableWhenInherited : 1;                                // 0x0092(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H81X : 1;                                      // 0x0092(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bCanEverAffectNavigation : 1;                              // 0x0092(0x0001) BIT_FIELD (Edit, Config, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BCC2 : 1;                                      // 0x0092(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bIsEditorOnly : 1;                                         // 0x0092(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_75Y3[0x1];                                     // 0x0093(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	Engine_EComponentCreationMethod                    CreationMethod;                                            // 0x0094(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnComponentActivated;                                      // 0x0095(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	struct FMulticastSparseDelegate                    OnComponentDeactivated;                                    // 0x0096(0x0001) (InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Z7HD[0x1];                                     // 0x0097(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FSimpleMemberReference>              UCSModifiedProperties;                                     // 0x0098(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_OCPR[0x10];                                    // 0x00A8(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class Engine.actorComponent");
		return ptr;
	}



	void ToggleActive();
	void SetTickGroup(TEnumAsByte<Engine_ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetIsReplicated(bool shouldReplicate);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickEnabled(bool bEnabled);
	void SetAutoActivate(bool bNewAutoActivate);
	void SetActive(bool bNewActive, bool bReset);
	void RemoveTickPrerequisiteComponent(class UactorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class Uactor* PrerequisiteActor);
	void ReceiveTick(float deltaSeconds);
	void ReceiveEndPlay(TEnumAsByte<Engine_EEndPlayReason> endPlayReason);
	void ReceiveBeginPlay();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool isActive();
	class Uactor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(const struct FName& tag);
	void AddTickPrerequisiteComponent(class UactorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class Uactor* PrerequisiteActor);
	void activate(bool bReset);
};

// Class Engine.SceneComponent
// 0x0158 (FullSize[0x0210] - InheritedSize[0x00B8])
class USceneComponent : public UactorComponent
{
public:
	unsigned char                                      UnknownData_SMOV[0x8];                                     // 0x00B8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TWeakObjectPtr<class UPhysicsVolume>               PhysicsVolume;                                             // 0x00C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                             AttachParent;                                              // 0x00C8(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       AttachSocketName;                                          // 0x00D0(0x000C) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_SMHE[0x4];                                     // 0x00DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class USceneComponent*>                     AttachChildren;                                            // 0x00E0(0x0010) (ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USceneComponent*>                     ClientAttachedChildren;                                    // 0x00F0(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_NVW2[0x34];                                    // 0x0100(0x0034) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct Fvector                                     RelativeLocation;                                          // 0x0134(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                                    RelativeRotation;                                          // 0x0140(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct Fvector                                     RelativeScale3D;                                           // 0x014C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct Fvector                                     ComponentVelocity;                                         // 0x0158(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SJ8W : 1;                                      // 0x0164(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bComponentToWorldUpdated : 1;                              // 0x0164(0x0001) BIT_FIELD (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_R2NE : 1;                                      // 0x0164(0x0001) BIT_FIELD (PADDING)
	unsigned char                                      bAbsoluteLocation : 1;                                     // 0x0164(0x0001) BIT_FIELD (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bAbsoluteRotation : 1;                                     // 0x0164(0x0001) BIT_FIELD (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bAbsoluteScale : 1;                                        // 0x0164(0x0001) BIT_FIELD (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bVisible : 1;                                              // 0x0164(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bShouldBeAttached : 1;                                     // 0x0164(0x0001) BIT_FIELD (Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bShouldSnapLocationWhenAttached : 1;                       // 0x0165(0x0001) BIT_FIELD (Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      bShouldSnapRotationWhenAttached : 1;                       // 0x0165(0x0001) BIT_FIELD (Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
